app/views/collections/show.html.erb

    <div class="pricing-tables pure-g">
    <% @collection.articles.each do |article| %>
---
SELECT "articles".* FROM "articles" INNER JOIN "collection_articles" ON "articles"."id" = "collection_articles"."article_id" WHERE "collection_articles"."collection_id" = $1